In [1]:
import pandas as pd
import numpy as np

In [3]:
Employee=pd.DataFrame({'id':[1,2,3,4],'name':['Joe','Henry','Sam','Max'],'salary':[70000,80000,60000,90000],'managerId':[3,4,np.nan,np.nan]})
Employee

   id   name  salary  managerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

In [6]:
table=pd.merge(Employee,Employee,how='left',left_on='id',right_on='managerId')
table

   id_x name_x  salary_x  managerId_x  id_y name_y  salary_y  managerId_y
0     1    Joe     70000          3.0   NaN    NaN       NaN          NaN
1     2  Henry     80000          4.0   NaN    NaN       NaN          NaN
2     3    Sam     60000          NaN   1.0    Joe   70000.0          3.0
3     4    Max     90000          NaN   2.0  Henry   80000.0          4.0

In [9]:
#1
for i in range(len(table['id_x'])):
    if table.loc[i,'salary_y']>table.loc[i,'salary_x']:
        print(table.loc[i,'name_y'])

Joe

In [11]:
#2
table[table['salary_y']>table['salary_x']]['name_y']

2    Joe
Name: name_y, dtype: object